# Requirements:
# homebrew - http://brew.sh/
# brew bundle - https://github.com/Homebrew/homebrew-bundle
# cask - https://caskroom.github.io/ (installed automatically)
# mas-cli - https://github.com/argon/mas

cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'vapor/tap'
tap 'ibm-swift/kitura'

# Package Managers
brew 'carthage'
brew 'cocoapods'

brew 'coreutils'
brew 'python3'
brew 'git'
brew 'libxml2'
brew 'libxslt'
brew 'openssl'

brew 'node'
brew 'sqlite'
brew 'postgresql'

# Swift/iOS
brew 'kitura'
brew 'vapor/tap/vapor'

# Mac Apps
cask '1password'
cask 'alfred'
cask 'atom'
cask 'bartender'
cask 'caffeine'
cask 'charles'
cask 'chitchat'
cask 'coderunner'
cask 'dash'
cask 'deckset'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'karabiner'
cask 'karabiner-elements'
cask 'macdown'
cask 'paw'
cask 'postgres'
cask 'postman'
cask 'sketch'
cask 'sublime-text'
cask 'textexpander'
cask 'transmit'
cask 'wwdc'

# MAS Apps
brew 'mas'

mas 'Slack', id: 803453959
mas 'Tweetbot', id: 1384080005
mas 'Things 3', id: 904280696
mas 'Moom', id; 419330170
mas 'Haskell', id: 841285201
mas 'Mind Node', id: 1289197285
mas 'Reeder', id: 880001334