cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Package Managers
brew 'rbenv'
brew 'carthage'

brew 'coreutils'
brew 'python3'
brew 'node'
brew 'git'
brew 'libxml2'
brew 'libxslt'

# Mac Apps
cask 'iterm2'
cask '1password'
cask 'atom'
cask 'google-chrome'
cask 'slack'
cask 'macvim'
cask 'dropbox'
cask 'skitch'
cask 'dash'
cask 'wwdc'
cask 'caffeine'
