# Requirements:
# homebrew - http://brew.sh/
# brew bundle - https://github.com/Homebrew/homebrew-bundle
# cask - https://caskroom.github.io/ (installed automatically)
# mas-cli - https://github.com/argon/mas

cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'

# Package Managers
brew 'carthage'
brew 'cocoapods'

brew 'coreutils'
brew 'python3'
brew 'git'
brew 'libxml2'
brew 'libxslt'
brew 'openssl'

brew 'node'
brew 'npm'
brew 'sqlite'
brew 'postgresql'

# Mac Apps
cask '1password'
cask 'bartender'
cask 'caffeine'
cask 'charles'
cask 'docker'
cask 'iterm2'
cask 'paw'
cask 'postgres'
cask 'sublime-merge-dev'
cask 'font-fira-code'
cask 'slack'
cask 'spectacle'

# Mac App Store

brew 'mas'
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005